app/controllers/animals_controller.rb

  def create
    Animal.create(animal_params)
---
INSERT INTO "animals" ("name", "age", "created_at", "updated_at", "leg_numbers", "image") VALUES (?, ?, ?, ?, ?, ?)  [["name", "abc"], ["age", 20], ["created_at", 2017-03-24 04:21:40 UTC], ["updated_at", 2017-03-24 04:21:40 UTC], ["leg_numbers", 2], ["image", "http://loremflickr.com/320/240/dog"]]

  def edit
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    animal = Animal.find(params[:id])
    animal.update_attributes(animal_params)
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "animals" SET "image" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["image", "http://www.publicdomainpictures.net/pictures/40000/nahled/dog-cartoon.jpg"], ["updated_at", 2017-03-24 21:16:31 UTC], ["id", 9]]

  def destroy
    animal = Animal.find(params[:id])
    animal.destroy
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]